#  4.9: Intro to Data Visualization with Python - Part 1

## Table of content:

### Task 3 - Import your analysis libraries, as well as your new customer data set as a dataframe.

### Task 4 - Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis

### Task 5 - Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

### Task 6 - Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

### Task 7 - Ensure your notebook contains logical titles, section headings, and descriptive code comments.

### Task 8 - Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

## Task 3

Import your analysis libraries, as well as your new customer data set as a dataframe

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'C:\Users\facun\Desktop\Data Analysis\CF\PYTHON\Instacart Basket Analysis'

In [3]:
df_customer = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'),index_col = False)

# Task 4

Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that don’t add anything to your analysis.

### 1) Exploring dataframe

In [4]:
df_customer.head(100)

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
95,86389,Stephen,Murillo,Male,Vermont,69,1/1/2017,3,married,66800
96,102956,Kathy,Mitchell,Female,Missouri,78,1/1/2017,1,married,96314
97,180919,Jacqueline,Roach,Female,Nebraska,21,1/1/2017,3,living with parents and siblings,56831
98,74155,Karen,Berg,Female,Alabama,33,1/1/2017,3,married,95285
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673

### 2) Dataframe Statistics

In [5]:
df_customer.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

### 3) Checking column names

In [6]:
df_customer.columns

Index(['user_id', 'First Name', 'Surnam', 'Gender', 'STATE', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

#### - Renaming Columns

In [7]:
df_customer.rename(columns = {'First Name' : 'First_Name'}, inplace = True) 
df_customer.rename(columns = {'Surnam' : 'Last_Name'}, inplace = True)
df_customer.rename(columns = {'STATE' : 'State'}, inplace = True)

#### - Confirm renaming of Columns

In [8]:
df_customer.columns

Index(['user_id', 'First_Name', 'Last_Name', 'Gender', 'State', 'Age',
       'date_joined', 'n_dependants', 'fam_status', 'income'],
      dtype='object')

### 4) Dataframe information

In [9]:
df_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First_Name    194950 non-null  object
 2   Last_Name     206209 non-null  object
 3   Gender        206209 non-null  object
 4   State         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

#### - Observation:

The column "First Name" has less number of values than the rest of the columns, mean that we have 11.259 empty cells

In [10]:
# Checks the assignated column data frequency

df_customer['First_Name'].value_counts(dropna = False)

NaN        11259
Marilyn     2213
Barbara     2154
Todd        2113
Jeremy      2104
           ...
Merry        197
Eugene       197
Garry        191
Ned          186
David        186
Name: First_Name, Length: 208, dtype: int64

#### - Changing data types

In [11]:
# Changing data type of the column "user_id" as it should not be taking it as integer, should be string(object)

df_customer['user_id'] = df_customer['user_id'].astype('str')

In [12]:
# Check the data type of the column was modified 

df_customer['user_id'].dtype

dtype('O')

Now we run the Statistics again and function won't consider **user_id** as a numerical value

In [13]:
df_customer.describe()

                 Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

#### 5) Checking Dataframe Shape

In [14]:
df_customer.shape

(206209, 10)

## Task 5

Complete the fundamental data quality and consistency checks you’ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

### 1) Finding and Addressing Mixed Data Types

In [15]:
for col in df_customer.columns.tolist():
    weird = (df_customer[[col]].applymap(type) != df_customer[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (df_customer[weird]) > 0:
        print(col)

First_Name

#### Answer: 

I found that the **First_Name** column has Mixed Data Types

- Fixing columns with **Mixed Data Types**

### 2) Finding Missing Values

In [16]:
# Checks for missing observations

df_customer.isnull().sum()

user_id             0
First_Name      11259
Last_Name           0
Gender              0
State               0
Age                 0
date_joined         0
n_dependants        0
fam_status          0
income              0
dtype: int64

#### Answer:

We found that the column "First_Name" has missing values which will not be filled as there is no way to find the names unless the custome can provide us with a informtion to do it. Also, we can not delete the column as those rows still can have valued information.

We will change the Data Type of the **"First_Name"** column because it has integer datatype **0** because of the **null values** to String.

In [17]:
#Change the datatype of First Name to a String
df_customer['First_Name'] = df_customer['First_Name'].astype('str')

In [18]:
# Checks for the modification success

df_customer.isnull().sum()

user_id         0
First_Name      0
Last_Name       0
Gender          0
State           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

### 3) Finding Duplicates

In [19]:
df_dups = df_customer[df_customer.duplicated()]

In [20]:
df_dups

Empty DataFrame
Columns: [user_id, First_Name, Last_Name, Gender, State, Age, date_joined, n_dependants, fam_status, income]
Index: []

## Task 6

Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!

#### Importing "ords_prods_merge" dataframe

In [21]:
df_orders_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_prods_merge.pkl'))

#### "orders_prods_merge" dataframe information

In [22]:
df_orders_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406041 entries, 0 to 32406040
Data columns (total 23 columns):
 #   Column                        Dtype
---  ------                        -----
 0   order_id                      int64
 1   user_id                       int64
 2   order_number                  int64
 3   orders_day_of_week            int64
 4   order_hour_of_day             int64
 5   days_since_last_order         float64
 6   product_id                    int64
 7   add_to_cart_order             int64
 8   reordered                     int64
 9   product_name                  object
 10  aisle_id                      int64
 11  department_id                 int64
 12  prices                        float64
 13  _merge                        category
 14  price_range_loc               object
 15  businest_day                  object
 16  businest_period_of_day        object
 17  max_order                     int64
 18  loyalty_flag                  object
 19  average_price                 float64
 20  spending_flag                 object
 21  median_days_since_last_order  float64
 22  order_frequency_flag          object
dtypes: category(1), float64(4), int64(11), object(7)
memory usage: 5.6+ GB

In [23]:
df_orders_prods_merge.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,...,_merge,price_range_loc,businest_day,businest_period_of_day,max_order,loyalty_flag,average_price,spending_flag,median_days_since_last_order,order_frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,both,Mid-range product,Regularly busy,Average orders,10,New customer,6.37,Low_spender,20.5,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,both,Mid-range product,Least busy,Average orders,10,New customer,6.37,Low_spender,20.5,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,both,Mid-range product,Least busy,Most orders,10,New customer,6.37,Low_spender,20.5,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,both,Mid-range product,Least busy,Average orders,10,New customer,6.37,Low_spender,20.5,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,both,Mid-range product,Least busy,Most orders,10,New customer,6.37,Low_spender,20.5,Non-frequent customer

#### Deleting "_merge" flag as it is unnecesary now

In [27]:
del df_orders_prods_merge['_merge']

#### Checking dataframe shape

In [28]:
df_orders_prods_merge.shape

(32406041, 22)

#### Changing Datatype

In [24]:
#Change the datatype of "user_id" column to a String
df_orders_prods_merge['user_id'] = df_orders_prods_merge['user_id'].astype('str')

#### Changing columns names

In [25]:
df_orders_prods_merge.rename(columns = {'businest_day' : 'busiest_day'}, inplace = True) 
df_orders_prods_merge.rename(columns = {'businest_period_of_day' : 'busiest_period_of_day'}, inplace = True)

#### Checking customer data frame shape

In [30]:
df_customer.shape

(206209, 10)

## Combine "df_customers" into "df_orders_prods_merge"

In [31]:
df_combined_file = df_orders_prods_merge.merge(df_customer, on = 'user_id', indicator = True)

#### Checking df_combined information

In [33]:
df_combined_file.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32406041 entries, 0 to 32406040
Data columns (total 32 columns):
 #   Column                        Dtype
---  ------                        -----
 0   order_id                      int64
 1   user_id                       object
 2   order_number                  int64
 3   orders_day_of_week            int64
 4   order_hour_of_day             int64
 5   days_since_last_order         float64
 6   product_id                    int64
 7   add_to_cart_order             int64
 8   reordered                     int64
 9   product_name                  object
 10  aisle_id                      int64
 11  department_id                 int64
 12  prices                        float64
 13  price_range_loc               object
 14  busiest_day                   object
 15  busiest_period_of_day         object
 16  max_order                     int64
 17  loyalty_flag                  object
 18  average_price                 float64
 19  spending_flag                 object
 20  median_days_since_last_order  float64
 21  order_frequency_flag          object
 22  First_Name                    object
 23  Last_Name                     object
 24  Gender                        object
 25  State                         object
 26  Age                           int64
 27  date_joined                   object
 28  n_dependants                  int64
 29  fam_status                    object
 30  income                        int64
 31  _merge                        category
dtypes: category(1), float64(4), int64(13), object(14)
memory usage: 7.8+ GB

#### Checking new dataframe shape

In [34]:
df_combined_file.shape

(32406041, 32)

In [35]:
df_combined_file['_merge'].value_counts()

both          32406041
left_only            0
right_only           0
Name: _merge, dtype: int64

## Task 7

Ensure your notebook contains logical titles, section headings, and descriptive code comments.

## Task 8

Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [36]:
df_combined_file.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'combined_file.pkl'))